In [6]:
import pandas as pd
import numpy as np

# DataFrame

In [7]:
data = np.random.randn(4,3)
data

array([[ 0.86687787, -0.90615303,  1.15056107],
       [-1.02824024, -0.49041131,  0.61538239],
       [-0.12683534, -0.97975937, -0.1597228 ],
       [-2.03875346,  0.82816011, -0.38991175]])

In [8]:
dataFrame=pd.DataFrame(data)
dataFrame

          0         1         2
0  0.866878 -0.906153  1.150561
1 -1.028240 -0.490411  0.615382
2 -0.126835 -0.979759 -0.159723
3 -2.038753  0.828160 -0.389912

In [9]:
print(dataFrame[0])

0    0.866878
1   -1.028240
2   -0.126835
3   -2.038753
Name: 0, dtype: float64

In [10]:
data2 = np.random.randint(10, size=(4, 3))

In [11]:
yeniDataFrame=pd.DataFrame(data2,index=["Atıl","Zeynep","Atlas","Mehmet"],columns=["Maaş","Yaş","Çalışma Saati"])

In [12]:
yeniDataFrame

        Maaş  Yaş  Çalışma Saati
Atıl       4    0              8
Zeynep     6    6              5
Atlas      8    7              8
Mehmet     3    5              4

In [13]:
yeniDataFrame["Çalışma Saati"]

Atıl      8
Zeynep    5
Atlas     8
Mehmet    4
Name: Çalışma Saati, dtype: int32

In [14]:
print(yeniDataFrame["Maaş"])

Atıl      4
Zeynep    6
Atlas     8
Mehmet    3
Name: Maaş, dtype: int32

In [15]:
yeniDataFrame[["Maaş","Yaş"]]

        Maaş  Yaş
Atıl       4    0
Zeynep     6    6
Atlas      8    7
Mehmet     3    5

In [16]:
#pandas column arama yapıyor (yeniDataFrame["Maaş"]) satırda arama direkt olmuyor, aşağıdaki gibi oluyor

In [17]:
yeniDataFrame.loc["Atıl"]

Maaş             4
Yaş              0
Çalışma Saati    8
Name: Atıl, dtype: int32

## DataFrame indeks

In [18]:
yeniDataFrame["Emeklilik Yaşı"] = yeniDataFrame["Yaş"] + yeniDataFrame["Yaş"] #dataframe sütun ekleme
yeniDataFrame

        Maaş  Yaş  Çalışma Saati  Emeklilik Yaşı
Atıl       4    0              8               0
Zeynep     6    6              5              12
Atlas      8    7              8              14
Mehmet     3    5              4              10

In [19]:
yeniDataFrame.drop("Emeklilik Yaşı",axis=1)  #axis=1 demek sütun oluyor

        Maaş  Yaş  Çalışma Saati
Atıl       4    0              8
Zeynep     6    6              5
Atlas      8    7              8
Mehmet     3    5              4

In [20]:
yeniDataFrame.drop("Mehmet",axis=0)  #axis=0 demek satır oluyor

        Maaş  Yaş  Çalışma Saati  Emeklilik Yaşı
Atıl       4    0              8               0
Zeynep     6    6              5              12
Atlas      8    7              8              14

In [21]:
yeniDataFrame  #drop işlemi yapılırken inplace=True parametresi olmazsa ana kütlede değişiklik olmaz

        Maaş  Yaş  Çalışma Saati  Emeklilik Yaşı
Atıl       4    0              8               0
Zeynep     6    6              5              12
Atlas      8    7              8              14
Mehmet     3    5              4              10

In [22]:
yeniDataFrame.drop("Emeklilik Yaşı",axis=1,inplace=True)
yeniDataFrame

        Maaş  Yaş  Çalışma Saati
Atıl       4    0              8
Zeynep     6    6              5
Atlas      8    7              8
Mehmet     3    5              4

In [23]:
yeniDataFrame.loc["Atıl"]["Maaş"]

4

In [24]:
yeniDataFrame.loc["Atıl"][:2]

Maaş    4
Yaş     0
Name: Atıl, dtype: int32

In [25]:
yeniDataFrame < 5

         Maaş    Yaş  Çalışma Saati
Atıl     True   True          False
Zeynep  False  False          False
Atlas   False  False          False
Mehmet   True  False           True

In [26]:
yeniDataFrame[yeniDataFrame<5]

        Maaş  Yaş  Çalışma Saati
Atıl     4.0  0.0            NaN
Zeynep   NaN  NaN            NaN
Atlas    NaN  NaN            NaN
Mehmet   3.0  NaN            4.0

In [27]:
booleanDataFrame = yeniDataFrame < 5
booleanDataFrame

         Maaş    Yaş  Çalışma Saati
Atıl     True   True          False
Zeynep  False  False          False
Atlas   False  False          False
Mehmet   True  False           True

In [28]:
yeniDataFrame

        Maaş  Yaş  Çalışma Saati
Atıl       4    0              8
Zeynep     6    6              5
Atlas      8    7              8
Mehmet     3    5              4

In [29]:
yeniDataFrame[booleanDataFrame]

        Maaş  Yaş  Çalışma Saati
Atıl     4.0  0.0            NaN
Zeynep   NaN  NaN            NaN
Atlas    NaN  NaN            NaN
Mehmet   3.0  NaN            4.0

In [30]:
yeniDataFrame[yeniDataFrame < 5]

        Maaş  Yaş  Çalışma Saati
Atıl     4.0  0.0            NaN
Zeynep   NaN  NaN            NaN
Atlas    NaN  NaN            NaN
Mehmet   3.0  NaN            4.0

In [31]:
yeniDataFrame["Yaş"] > 0

Atıl      False
Zeynep     True
Atlas      True
Mehmet     True
Name: Yaş, dtype: bool

In [32]:
yeniDataFrame[yeniDataFrame["Yaş"] > 2]  #yaşı 2'den büyük olanları getiriyor.

        Maaş  Yaş  Çalışma Saati
Zeynep     6    6              5
Atlas      8    7              8
Mehmet     3    5              4

## Index değiştirme

In [33]:
yeniIndeksListesi=["Ati","Zey","Atl","Meh"]

In [34]:
yeniDataFrame["Yeni Index"]=yeniIndeksListesi

In [35]:
yeniDataFrame

        Maaş  Yaş  Çalışma Saati Yeni Index
Atıl       4    0              8        Ati
Zeynep     6    6              5        Zey
Atlas      8    7              8        Atl
Mehmet     3    5              4        Meh

In [36]:
yeniDataFrame.set_index("Yeni Index")

            Maaş  Yaş  Çalışma Saati
Yeni Index
Ati            4    0              8
Zey            6    6              5
Atl            8    7              8
Meh            3    5              4

In [37]:
yeniDataFrame  #inplace=True yapmadığım için değişiklikler kaydolmadı

        Maaş  Yaş  Çalışma Saati Yeni Index
Atıl       4    0              8        Ati
Zeynep     6    6              5        Zey
Atlas      8    7              8        Atl
Mehmet     3    5              4        Meh

In [38]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [39]:
yeniDataFrame

            Maaş  Yaş  Çalışma Saati
Yeni Index
Ati            4    0              8
Zey            6    6              5
Atl            8    7              8
Meh            3    5              4

In [40]:
yeniDataFrame.loc["Ati"]

Maaş             4
Yaş              0
Çalışma Saati    8
Name: Ati, dtype: int32

## Multi Index

In [41]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [42]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [43]:
birlesmisIndeksler = list(zip(ilkIndeksler,icIndeksler))
birlesmisIndeksler

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [44]:
birlesmisIndeksler = pd.MultiIndex.from_tuples(birlesmisIndeksler)
birlesmisIndeksler

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [45]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [46]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [47]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeksler,columns=["Yas","Meslek"])

In [48]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [50]:
cizgiFilmDataFrame["Yas"]

Simpson     Homer      40
            Bart       10
            Marge      30
South Park  Cartman     9
            Kenny      10
            Kyle       11
Name: Yas, dtype: object

In [51]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [53]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [54]:
cizgiFilmDataFrame.index.names = ["Film adı","İsim"]

In [55]:
cizgiFilmDataFrame

                   Yas Meslek
Film adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F